app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE (name like '%baked')
---
  def index
    @recipes = if params[:keywords]
                 Recipe.where('name ilike ?',"%#{params[:keywords]}%")

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", -9999]]
---
  def show
  	@recipe = Recipe.find(params[:id])